{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_2_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": false, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 238, "output_dim": 300, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.13544000685214996, 0.14539000391960144, 0.0981760025024414, 0.02792700007557869, 0.13773000240325928, -0.1015700027346611, -0.07746899873018265, -0.08812599629163742, 0.33730998635292053, -1.6983000040054321, 0.1521800011396408, 0.07474999874830246, 0.02991499938070774, 0.05142199993133545, -0.0029722999315708876, 0.12387999892234802, 0.04329900071024895, 0.08980199694633484, -0.20464999973773956, -0.05586199834942818, 0.31790998578071594, 0.03453399986028671, 0.2944999933242798, -0.127020001411438, -0.052014999091625214, -0.2160400003194809, 0.036685001105070114, 0.010580999776721, -0.41787999868392944, -0.057078998535871506, -0.04899299889802933, 0.3571699857711792, 0.1653899997472763, 0.1886100023984909, -1.6051000356674194, 0.02281999960541725, -0.11232999712228775, -0.040445998311042786, -0.14177000522613525, 0.31595999002456665, 0.39601001143455505, -0.010630999691784382, -0.31988000869750977, -0.12419000267982483, 0.07770299911499023, 0.2371699959039688, 0.4887300133705139, 0.5172600150108337, -0.1260399967432022, 0.13104000687599182, 0.48240000009536743, -0.32694000005722046, -0.08431900292634964, -0.051010001450777054, -0.21287000179290771, 0.23481999337673187, -0.17468999326229095, 0.09868499636650085, 0.08882900327444077, 0.10876999795436859, 0.2696000039577484, -0.16976000368595123, -0.05989399924874306, -0.10842999815940857, 0.019633999094367027, -0.6330000162124634, -0.059735000133514404, 0.14916999638080597, 0.17865000665187836, -0.20738999545574188, 0.028565000742673874, 0.09719499945640564, -0.3152399957180023, 0.3396799862384796, -0.10189999639987946, 0.4113500118255615, -0.025738000869750977, -0.034290000796318054, -0.19163000583648682, -0.3036800026893616, -0.2771199941635132, -0.015595999546349049, 0.09746699780225754, 0.19517000019550323, 0.23848000168800354, 0.04676999896764755, -0.04060300067067146, 0.14047999680042267, 0.14904999732971191, 0.22328999638557434, -0.12273000180721283, 0.253710001707077, -0.1361600011587143, -0.23703999817371368, -0.4367299973964691, -0.07881999760866165, -0.2835400104522705, -0.05164799839258194, 0.26785001158714294, -0.5702199935913086, -0.12007000297307968, 0.2467699944972992, -0.03449900075793266, 0.09912999719381332, -0.0022940998896956444, -0.1994899958372116, 0.014268999919295311, 0.390749990940094, -0.26548999547958374, 0.44582998752593994, -0.0914200022816658, 0.15851999819278717, -0.18928000330924988, -0.060329001396894455, -0.12993000447750092, 0.20732000470161438, 0.019334999844431877, -0.002828200114890933, 0.26524001359939575, -0.41036999225616455, -0.3928599953651428, 0.1818999946117401, 0.11568000167608261, -0.04408099874854088, 0.03423300012946129, 0.20548999309539795, 0.1289599984884262, 0.1832900047302246, 0.05202599987387657, 0.16216999292373657, 0.15437999367713928, 0.06769800186157227, 0.17242999374866486, -0.12657000124454498, -0.3525199890136719, -0.0583450011909008, -0.18192000687122345, -0.39250999689102173, -0.2058899998664856, 0.31301000714302063, -0.41881000995635986, 0.009740299545228481, 0.023300999775528908, 0.3407900035381317, -0.12524999678134918, -0.39305999875068665, 0.002154499990865588, 0.04185099899768829, 0.11174000054597855, -0.08843699842691422, 0.12554000318050385, -0.11180999875068665, 0.034742001444101334, 0.18625999987125397, 0.3147200047969818, -0.34641000628471375, -0.06791699677705765, 0.11817000061273575, 0.08149400353431702, -0.21427999436855316, 0.02857300080358982, -0.5372700095176697, -0.010433999821543694, -0.2591499984264374, 0.14420999586582184, 0.31885001063346863, -0.363319993019104, 0.1543000042438507, 0.14316999912261963, 0.32135000824928284, 0.1675799936056137, 0.17633000016212463, -0.571179986000061, 0.11125999689102173, 0.1929900050163269, 0.09284999966621399, -0.08372800052165985, 0.12459000200033188, -0.10766000300645828, 0.7784000039100647, 0.11039000004529953, 0.36844000220298767, 0.1272599995136261, -0.16538000106811523, -0.05956900119781494, 0.21714000403881073, -0.31207001209259033, -0.037105001509189606, -0.143669992685318, 0.22699999809265137, 0.09528300166130066, 0.28176000714302063, 0.1796099990606308, -0.2690899968147278, -0.026246000081300735, -0.3738200068473816, -0.18528999388217926, 0.1774899959564209, 0.08720000088214874, -0.3405100107192993, 1.2487000226974487, -0.27856001257896423, 0.0917000025510788, -0.030381999909877777, 0.21140000224113464, 0.17383000254631042, -0.37237998843193054, 0.053022999316453934, 0.1147800013422966, -0.4043000042438507, -0.1010499969124794, -0.21375000476837158, 0.2748599946498871, -0.02341499924659729, -0.06346099823713303, 0.3400599956512451, -0.326200008392334, 0.21135999262332916, -0.12506000697612762, 0.2171500027179718, 0.2836199998855591, -0.14191000163555145, -0.4119899868965149, 0.15987999737262726, 0.25718000531196594, 0.0533440001308918, 0.3654800057411194, -0.18024000525474548, -0.01700500026345253, 0.07278800010681152, 0.23985999822616577, 0.23500999808311462, 0.2239599972963333, -0.3774400055408478, -0.08259899914264679, -0.021602999418973923, 0.32256001234054565, 0.221110001206398, 0.3821600079536438, 0.12437000125646591, -0.45096999406814575, 0.3802500069141388, 0.4077399969100952, 0.01006300002336502, -0.632830023765564, -0.09784200042486191, 0.2849400043487549, 0.27222999930381775, -0.23362000286579132, 0.014659999869763851, -0.15209999680519104, 0.03312100097537041, -0.09661699831485748, -0.12952999770641327, 0.402539998292923, 0.09429299831390381, 0.10315000265836716, -0.1003900021314621, -0.09245999902486801, 0.30856001377105713, 0.0136329997330904, -0.09828399866819382, -0.057583000510931015, 0.027063999325037003, 0.08785700052976608, 0.26276999711990356, -0.019950000569224358, -0.028087999671697617, 0.6525300145149231, 0.14057999849319458, -0.2029699981212616, 0.02542399987578392, 0.31926000118255615, 0.27265000343322754, 0.2336599975824356, 0.15634000301361084, -2.0905001163482666, -0.004518600180745125, 0.24281999468803406, 0.040314000099897385, -0.32058998942375183, -0.14208999276161194, 0.0813089981675148, -0.07789599895477295, -0.018943000584840775, 0.23130999505519867, -0.08511999994516373, 0.26996999979019165, -0.24118000268936157, -0.14381000399589539, -0.20740999281406403, -0.09723199903964996, -0.042869001626968384, -0.24658000469207764, 0.14991000294685364, 0.04074300080537796, -0.1846500039100647, -0.07242699712514877, -0.3301900029182434, 0.006130899768322706], [-0.17038999497890472, -0.36403998732566833, -0.053631000220775604, -0.1080000028014183, -0.1241300031542778, 0.18070000410079956, -0.20401999354362488, -0.43748000264167786, -0.10586000233888626, -1.688099980354309, 0.10733000189065933, 0.06195100024342537, -0.5368099808692932, 0.09051299840211868, -0.14285999536514282, -0.2797299921512604, 0.34022000432014465, 0.512969970703125, -0.4798099994659424, -0.6599400043487549, 0.11477000266313553, -0.06763900071382523, 0.0906049981713295, 0.30173999071121216, -0.14680999517440796, -0.2542099952697754, -0.47391998767852783, -0.15128999948501587, 0.03854700177907944, -0.06169800087809563, -0.48927998542785645, 0.023538999259471893, -0.3855400085449219, 0.27941998839378357, -0.5980600118637085, 0.09033499658107758, 0.1994899958372116, -0.2819800078868866, -0.37393999099731445, 0.013224000111222267, 0.00828159973025322, 0.0075921001844108105, -0.24169999361038208, 0.2877199947834015, 0.15476000308990479, -0.006688099820166826, -0.47964000701904297, 0.4977799952030182, 0.24180999398231506, 0.2209700047969818, 0.22822000086307526, -0.49035000801086426, 0.26078999042510986, -0.03901100158691406, 0.389710009098053, -0.09394499659538269, -0.29853999614715576, -0.11500000208616257, -0.14083999395370483, -0.01293100044131279, 0.5948100090026855, -0.2425999939441681, 0.27090999484062195, -0.43136999011039734, -0.24525000154972076, -0.4677700102329254, 0.07676199823617935, 0.063960000872612, 0.15171000361442566, 0.4196400046348572, 0.08073499798774719, 0.08578900247812271, -0.1296200007200241, 0.09093300253152847, 0.09939700365066528, -0.33324000239372253, -0.4334299862384796, 0.5960599780082703, -0.17381000518798828, 0.12701000273227692, -0.313289999961853, -0.6298499703407288, -0.020806999877095222, 0.0008500799885950983, 0.07542700320482254, -0.07978899776935577, -0.19679999351501465, 0.0752210021018982, -0.0665540024638176, 0.5399600267410278, -0.7914199829101562, 0.09111300110816956, -0.4168500006198883, 0.08908499777317047, 0.03878900036215782, -0.1757899969816208, -0.16064000129699707, 0.22825999557971954, 0.6169999837875366, -0.28466999530792236, -0.2050900012254715, -0.23273000121116638, 0.08132799714803696, 0.23934000730514526, -0.627269983291626, 0.1969500035047531, 0.047775998711586, 0.029790999367833138, 0.08905000239610672, -0.011133000254631042, 0.19000999629497528, -0.24506999552249908, -0.22741000354290009, -0.08928599953651428, 0.3078700006008148, 0.01631700061261654, 0.17143000662326813, -0.5007799863815308, 0.12348999828100204, 0.16940000653266907, 0.3910900056362152, -0.3751400113105774, -0.024390000849962234, 0.3767699897289276, -0.15117999911308289, 0.05766399949789047, 0.7473499774932861, 0.23520000278949738, -0.04561400040984154, 0.32615000009536743, -0.10975000262260437, 0.18065999448299408, -0.20306000113487244, -0.22789999842643738, -0.0015007000183686614, 0.036736998707056046, -0.01623399928212166, -0.1604900062084198, -0.36278000473976135, 0.3800800144672394, -0.17247000336647034, 0.2839699983596802, 0.0684249997138977, -0.2033499926328659, 0.07533100247383118, -0.2319599986076355, -0.19958999752998352, 0.15414999425411224, 0.11517000198364258, -0.25624001026153564, 0.03730599954724312, -0.43174999952316284, -0.034063998609781265, 0.14030000567436218, -0.2250799983739853, -0.5480800271034241, -0.48291999101638794, 0.060899000614881516, -0.05925200134515762, -0.30715999007225037, -0.30546998977661133, 0.49439001083374023, 0.12972000241279602, -0.10193999856710434, 0.04402599856257439, -0.094200000166893, -0.2822900116443634, 0.21246999502182007, -0.3164899945259094, 0.4070500135421753, 0.4563699960708618, 0.1084899976849556, -0.5610600113868713, -0.1805800050497055, 0.2707099914550781, 0.11151999980211258, 0.02246900089085102, 0.028162000700831413, -0.24650999903678894, 0.4131399989128113, 0.17889000475406647, -0.35912999510765076, -0.15127000212669373, -0.029418999329209328, -0.1712699979543686, -0.043685998767614365, -0.28407999873161316, -0.03315199911594391, 0.16495999693870544, 0.17798000574111938, -0.10989999771118164, 0.1320900022983551, 0.46378999948501587, -0.20396000146865845, -0.2464900016784668, -0.6367499828338623, -0.27226999402046204, 0.43601998686790466, -0.022928999736905098, -0.1588200032711029, 0.6598899960517883, -0.2343599945306778, -0.10516999661922455, -0.1177700012922287, -0.020862000063061714, -0.2880600094795227, 0.2506900131702423, 0.5324900150299072, 0.0768129974603653, -0.11297000199556351, -0.2687099874019623, -0.02778100036084652, 0.04029799997806549, -0.1527000069618225, 0.23266999423503876, 0.5083000063896179, 0.12430000305175781, 0.38475000858306885, -0.09792699664831161, -0.2751399874687195, 0.06873899698257446, 0.4639799892902374, 0.21080000698566437, 0.17453999817371368, -0.05927500128746033, 0.04822399839758873, 0.222680002450943, -0.042360998690128326, 0.15223999321460724, 0.00917929969727993, 0.12545999884605408, -0.030695000663399696, -0.07131800055503845, 0.12929999828338623, -0.17449000477790833, 0.03415700048208237, -0.09169899672269821, -0.03993599861860275, 0.06310100108385086, 0.6546400189399719, -0.09161199629306793, 0.23643000423908234, 0.8726900219917297, -0.026802999898791313, -0.8177599906921387, 0.07316700369119644, -0.14573000371456146, 0.24018999934196472, 0.023524999618530273, -0.043441999703645706, -0.25457999110221863, -0.0731080025434494, 0.15908999741077423, -0.3229199945926666, -0.6583700180053711, 0.04935599863529205, -0.6236199736595154, 0.15137000381946564, -0.2947799861431122, 0.05045299977064133, -0.4886299967765808, 0.013952000066637993, -0.07157699763774872, -0.12966999411582947, -0.29357999563217163, 0.381850004196167, 0.10499999672174454, -0.049215998500585556, -0.016652999445796013, 0.1296599954366684, 0.5976799726486206, -0.07763700187206268, 0.25707000494003296, 0.6418099999427795, 0.25582000613212585, 0.24225999414920807, -1.5923999547958374, -0.20882000029087067, 1.0159000158309937, -0.03584500029683113, -0.04788200184702873, -0.12705999612808228, -0.12748000025749207, 0.10108000040054321, 0.4710099995136261, 0.44429999589920044, -0.02997799962759018, -0.38938000798225403, 0.1549299955368042, -0.08795399963855743, -0.22634999454021454, 0.047304000705480576, -0.12633000314235687, -0.7502300143241882, 0.6054999828338623, 0.7870000004768372, -0.2705000042915344, -0.12330000102519989, 0.021410999819636345, 0.3073999881744385], [-0.3760400116443634, 0.24116000533103943, -0.2609800100326538, -0.007960399612784386, 0.21979999542236328, 0.09851499646902084, 0.23457999527454376, 0.1379700005054474, 0.1102600023150444, -1.7503000497817993, 0.15727999806404114, 0.5009899735450745, -0.07006800174713135, 0.02373100072145462, 0.39847999811172485, 0.3440600037574768, 0.27250000834465027, -0.3117299973964691, -0.08376400172710419, -0.22098000347614288, -0.27031999826431274, -0.06141199916601181, 0.23487000167369843, -0.10898000001907349, -0.5006800293922424, -0.191880002617836, -0.081557996571064, -0.49529001116752625, -0.11206000298261642, 0.055647000670433044, 0.34762001037597656, 0.38117000460624695, 0.25134000182151794, 0.22155000269412994, -0.6047400236129761, 0.1491599977016449, 0.03404400125145912, 0.08004099875688553, -0.025968000292778015, -0.024241000413894653, -0.25606998801231384, 0.15805000066757202, 0.05987900123000145, 0.35203999280929565, -0.33103999495506287, -0.21202999353408813, -0.11275999993085861, 0.21900999546051025, -0.427619993686676, -0.07337599992752075, 0.2087000012397766, -0.1919099986553192, 0.10251999646425247, 0.13545000553131104, 0.03474700078368187, 0.274399995803833, -0.14778999984264374, 0.031077999621629715, 0.2538500130176544, 0.31863999366760254, 0.289139986038208, 0.07655200362205505, 0.3844499886035919, 0.13276000320911407, -0.023181000724434853, -0.8094599843025208, 0.21976999938488007, 0.382860004901886, -0.009907900355756283, 0.13109999895095825, 0.03301699832081795, 0.06256800144910812, 0.13040000200271606, -0.05530500039458275, -0.4390299916267395, -0.07155200093984604, 0.24424000084400177, 0.02936200052499771, -0.0907600000500679, -0.0910940021276474, 0.19033999741077423, -0.2860099971294403, -0.09201899915933609, -0.018265999853610992, -0.04631799831986427, -0.22228999435901642, -0.003501300001516938, 0.37953999638557434, 0.042987000197172165, 0.2431900054216385, -0.6197299957275391, 0.17454999685287476, -0.010297000408172607, -0.1976899951696396, -0.02861100062727928, 0.25262999534606934, -0.4277400076389313, 0.1832599937915802, 0.04289399832487106, -0.45469000935554504, 0.02495500072836876, -0.19844000041484833, -0.22603000700473785, 0.544700026512146, -0.07838699966669083, -0.19610999524593353, -0.036302000284194946, -0.35798001289367676, 0.09827300161123276, 0.35701999068260193, 0.03334899991750717, -0.04125799983739853, -0.08886799961328506, -0.3727700114250183, 0.16962000727653503, -0.0018967000069096684, -0.11080999672412872, 0.118709996342659, 0.32646000385284424, -0.543179988861084, -0.006021200213581324, -0.42851999402046204, 0.11823999881744385, 0.13753999769687653, 0.15222999453544617, 0.013127000071108341, 0.29583001136779785, -0.1756799966096878, 0.3280099928379059, -0.34821999073028564, -0.39004001021385193, 0.5305500030517578, 0.2799299955368042, 0.34217000007629395, 0.10085999965667725, -0.19840000569820404, -0.23965999484062195, -0.08836700022220612, -0.2531000077724457, -0.08555100113153458, -0.318340003490448, -0.009588600136339664, -0.14605000615119934, 0.20636999607086182, -0.217289999127388, -0.10324999690055847, -0.12782999873161316, 0.3086499869823456, -0.4658699929714203, 0.2813499867916107, 0.07725899666547775, 0.024986999109387398, 0.07763999700546265, -0.19709999859333038, 0.10445000231266022, -0.01722799986600876, -0.045138999819755554, -0.04720500111579895, -0.1936500072479248, 0.12005999684333801, -0.11591000109910965, -0.06487900018692017, -0.13912999629974365, 0.13765999674797058, 0.16368000209331512, 0.47387999296188354, -0.003217000048607588, -0.15248000621795654, 0.16058999300003052, 0.4200499951839447, 0.37255001068115234, 0.4504599869251251, -0.39263999462127686, 0.2167000025510788, -0.24217000603675842, -0.27105000615119934, 0.21422000229358673, 0.3738099932670593, -0.2892099916934967, 0.6795700192451477, -0.09933999925851822, 0.14128999412059784, 0.13669000566005707, 0.18308000266551971, -0.0463699996471405, 0.18081000447273254, -0.20206999778747559, 0.11193999648094177, 0.4063499867916107, 0.041005998849868774, -0.26205000281333923, 0.2423900067806244, 0.10954000055789948, -0.0025108999107033014, -0.3105500042438507, -0.3947199881076813, 0.46873000264167786, -0.2660500109195709, 0.00031549998675473034, -0.27810001373291016, 0.7784500122070312, -0.08153799921274185, -0.1714800000190735, 0.17037999629974365, -0.03228899836540222, 0.36118000745773315, 0.07083000242710114, 0.3145799934864044, -0.5036399960517883, -0.41387999057769775, 0.19971999526023865, -0.34237998723983765, 0.37244999408721924, -0.04987400025129318, -0.039694998413324356, 0.11291000247001648, 0.44979000091552734, 0.29774999618530273, -0.14372999966144562, -0.11168000102043152, 0.00864460039883852, -0.14488999545574188, -0.289900004863739, -0.19744999706745148, -0.08555900305509567, -0.29690998792648315, 0.27410000562667847, -0.07175400108098984, 0.23884999752044678, -0.17967000603675842, 0.045781999826431274, 0.1941699981689453, 0.001740099978633225, -0.362529993057251, -0.04726799950003624, 0.609279990196228, 0.14531999826431274, -0.015873000025749207, -0.15849000215530396, -0.38260000944137573, -0.11274000257253647, -0.37487998604774475, 0.7609400153160095, -0.11912000179290771, -0.7791699767112732, 0.2074899971485138, 0.2998799979686737, -0.5649799704551697, 0.017913000658154488, -0.13273000717163086, 0.1593800038099289, -0.230320006608963, -0.2792400121688843, 0.15282000601291656, -0.04928100109100342, 0.047474998980760574, 0.1748100072145462, -0.1588599979877472, 0.28165000677108765, 0.053054001182317734, 0.00546600017696619, -0.5119799971580505, -0.08066099882125854, 0.06986600160598755, -0.16794000566005707, -0.5191199779510498, 0.1568399965763092, -0.0007167800213210285, 0.10138999670743942, 0.16274000704288483, 0.1891299933195114, 0.1579899936914444, 0.557479977607727, -0.051791999489068985, -0.14222000539302826, 0.0840110033750534, -1.8704999685287476, -0.2937999963760376, 0.4203200042247772, 0.09179999679327011, -0.2631300091743469, 0.12524999678134918, 0.4499799907207489, 0.3635300099849701, -0.19610999524593353, 0.12759999930858612, -0.304500013589859, -0.0611330009996891, -0.027884000912308693, -0.01100200042128563, -0.08379500359296799, -0.15809999406337738, 0.3256700038909912, -0.4293000102043152, 0.11056999862194061, 0.3122999966144562, -0.25578999519348145, -0.7573099732398987, 0.09739100188016891, -0.08183000236749649], [-0.16865000128746033, -0.4259899854660034, -0.11743000149726868, -0.20015999674797058, -0.18348999321460724, -0.49184998869895935, -0.01702200062572956, 0.19213999807834625, 0.2870100140571594, -2.0027999877929688, -0.2759299874305725, 0.3709000051021576, -0.17061999440193176, 0.166920006275177, 0.17433999478816986, -0.29462000727653503, 0.04848099872469902, 0.08498799800872803, -0.3286300003528595, 0.07952199876308441, 0.2207300066947937, 0.1686200052499771, 0.09350600093603134, 0.6249399781227112, -0.41499999165534973, 0.09574899822473526, -0.015320000238716602, -0.016797000542283058, -0.21573999524116516, -0.40070998668670654, 0.383870005607605, 0.3228600025177002, -0.8310199975967407, 0.5674700140953064, -1.0795999765396118, 0.3270300030708313, 0.16884000599384308, -0.3341200053691864, -0.2505500018596649, 0.08539000153541565, -0.022995000705122948, -0.011420000344514847, 0.11416999995708466, -0.40869998931884766, -0.6119599938392639, 0.08132600039243698, -0.5370799899101257, -0.2951200008392334, -0.39632999897003174, 0.11136999726295471, -0.252810001373291, -0.18226000666618347, 0.18448999524116516, -0.35361000895500183, 0.3411499857902527, 0.44435998797416687, 0.2097100019454956, -0.2772200107574463, 0.3919300138950348, 0.2011599987745285, 0.5612199902534485, 0.049403999000787735, 0.04775699973106384, 0.005784300155937672, -0.14347000420093536, 0.004364999942481518, 0.3818100094795227, 0.18815000355243683, -0.05847499892115593, 0.13574999570846558, -0.13970999419689178, -0.09343499690294266, 0.13003000617027283, 0.2945899963378906, -0.01649099960923195, 0.10769999772310257, -0.5519800186157227, -0.3400599956512451, -0.2767300009727478, -0.1417199969291687, -0.30219998955726624, 0.007942600175738335, -0.0042953998781740665, 0.11292999982833862, 0.3430199921131134, 0.3165000081062317, -0.0863339975476265, -0.12109000235795975, -0.09028799831867218, 0.38738998770713806, -0.10544999688863754, 0.3206000030040741, -0.47137999534606934, 0.07914900034666061, -0.1977500021457672, -0.4542900025844574, -0.3215300142765045, -0.4911699891090393, 0.38960000872612, -0.7692700028419495, -0.3764599859714508, 0.13495999574661255, 0.26910001039505005, -0.00909459963440895, -0.18042999505996704, 0.2398100048303604, -0.25391000509262085, 0.3114199936389923, -0.007179900072515011, 0.30083999037742615, 0.41251999139785767, 0.0429919995367527, -0.29394999146461487, 0.24075999855995178, -0.3739300072193146, 0.2760699987411499, -0.08743300288915634, -0.01324199978262186, -0.6979100108146667, -0.5914199948310852, 0.3299899995326996, 0.2012699991464615, 0.07245899736881256, -0.02136800065636635, 0.17494000494480133, 0.20417000353336334, -0.16854999959468842, 0.3115200102329254, -0.03031099960207939, 0.09958299994468689, 0.1872600018978119, 0.18900999426841736, -0.18779000639915466, 0.3081600069999695, 0.25536999106407166, 0.11339999735355377, -0.11542999744415283, -0.06407500058412552, -0.35569998621940613, 0.3713200092315674, -0.27011001110076904, -0.092228002846241, -0.44999000430107117, 0.28108999133110046, -0.3019599914550781, -0.05177899822592735, -0.41339001059532166, 0.6972799897193909, 0.07103899866342545, -0.1690399944782257, -0.0998380035161972, -0.2506900131702423, 0.03548699989914894, -0.39972999691963196, 0.3364500105381012, -0.3478600084781647, -0.03643200173974037, 0.03246400132775307, -0.8478400111198425, -0.29131999611854553, -0.0009284300031140447, -0.34880000352859497, -0.3033899962902069, 0.15530000627040863, -0.16252000629901886, 0.08372800052165985, 0.15478000044822693, 0.42348000407218933, -0.19044999778270721, 0.5265100002288818, -0.043393999338150024, -0.07336899638175964, 0.1685899943113327, -0.14328999817371368, 0.16902999579906464, -0.07138200104236603, 0.24122999608516693, -0.33959001302719116, -0.13053999841213226, 0.5743799805641174, -0.11416999995708466, -0.3555600047111511, 0.18208999931812286, -0.15212999284267426, 0.10751000046730042, 0.38861000537872314, -0.21630999445915222, 0.07467500120401382, -0.028418000787496567, -0.37003999948501587, -0.14538000524044037, 0.47633999586105347, -0.05241300165653229, -0.6298099756240845, 0.18226000666618347, 0.13439999520778656, 0.615809977054596, -0.048920001834630966, 0.0953259989619255, 0.05395200103521347, 0.30395999550819397, -0.1055700033903122, -0.460099995136261, -0.06141500174999237, 0.2015399932861328, 0.040651001036167145, -0.22427000105381012, 0.0965069979429245, 0.06120000034570694, -0.25196000933647156, 0.28047001361846924, -0.39921000599861145, 0.1921900063753128, 0.022151999175548553, 0.011032000184059143, 0.33524999022483826, 0.5268200039863586, 0.44881001114845276, 0.4614099860191345, -0.052018001675605774, -0.36258000135421753, 0.14388999342918396, 0.2946699857711792, -0.2711699903011322, 0.492110013961792, 0.2525100111961365, 0.3131900131702423, 0.6899499893188477, -0.04256099835038185, -0.31196001172065735, 0.26179999113082886, 0.41668999195098877, 0.35877999663352966, -0.36831000447273254, 0.24529999494552612, -0.20837000012397766, 0.06696400046348572, -0.05515599995851517, 0.5790500044822693, 0.6821900010108948, 0.24211999773979187, 0.0272039994597435, 0.5355700254440308, 0.41187000274658203, -1.3733999729156494, -0.004040599800646305, 0.25369998812675476, -0.024529999122023582, 0.23747999966144562, 0.11083000153303146, -0.003324700053781271, -0.4251300096511841, 0.04439999908208847, 0.23791000247001648, -0.21975000202655792, 0.10631000250577927, 0.29203999042510986, -0.04281200096011162, 0.15982000529766083, 0.0780550017952919, -0.42737001180648804, -0.19652999937534332, 0.05337100103497505, 0.18216000497341156, 0.1152300015091896, -0.09661000221967697, -0.24208000302314758, 0.3493500053882599, -0.4344500005245209, -0.260019987821579, 0.03891000151634216, 0.3192099928855896, -0.26372000575065613, -0.05038600042462349, 0.3286600112915039, 0.31018000841140747, -1.5843000411987305, 0.3118000030517578, 0.9612399935722351, 0.15428000688552856, -0.004697899799793959, 0.4715000092983246, 0.4142099916934967, 0.2360299974679947, 0.27410998940467834, -0.3965199887752533, -0.13267000019550323, -0.3732199966907501, -0.17600999772548676, -0.027701999992132187, 0.1404699981212616, -0.14803999662399292, 0.005057999864220619, 0.13715000450611115, -0.05592799931764603, 0.1345600038766861, -0.4477800130844116, -0.06343100219964981, 0.006847199983894825, -0.08600199967622757], [0.007855700328946114, -0.48677000403404236, -0.04300199821591377, 0.13635000586509705, -0.390859991312027, -0.06476700305938721, 0.25317999720573425, -0.15579000115394592, 0.03279799968004227, -1.070199966430664, -0.2381500005722046, 0.3698599934577942, -0.06644199788570404, -0.10242000222206116, -0.20544999837875366, 0.125900000333786, -0.32027000188827515, -0.25286999344825745, -0.3739500045776367, -0.18747000396251678, 0.21884000301361084, 0.5085499882698059, 0.3471600115299225, -0.18332000076770782, -0.5112199783325195, -0.2684600055217743, -0.07341299951076508, -0.33715999126434326, -0.277539998292923, 0.1111299991607666, -0.5045499801635742, -0.047047000378370285, -0.20444999635219574, -0.15154999494552612, -1.1668000221252441, -0.24740999937057495, -0.5402200222015381, -0.48855000734329224, 0.22075000405311584, -0.2139499932527542, -0.059755999594926834, -0.22949999570846558, 0.03703099861741066, 0.5916600227355957, -0.31606999039649963, -0.11712999641895294, 0.21841000020503998, -0.2745499908924103, -0.39506998658180237, -0.31268998980522156, 0.21119999885559082, -0.19638000428676605, 0.011998999863862991, 0.0963049978017807, -0.2279299944639206, 0.3008800148963928, -0.31863000988960266, -0.15780000388622284, 0.21209000051021576, 0.03524399921298027, 0.006337299942970276, 0.0017274999991059303, 0.3808099925518036, -0.08584000170230865, -0.1842299997806549, -0.3828499913215637, 0.5366700291633606, -0.39059001207351685, -0.16814999282360077, -0.4009000062942505, 0.18097999691963196, -0.3808099925518036, 0.010288000106811523, 0.04241799935698509, -0.23773999512195587, 0.07333599776029587, -0.37509000301361084, 0.24567000567913055, -0.09692300111055374, -0.38356998562812805, 0.0968869999051094, 0.10937000066041946, -0.356440007686615, -0.16237999498844147, -0.07503099739551544, -0.14879000186920166, 0.3806700110435486, -0.2077600061893463, -0.23330000042915344, 0.4402199983596802, -0.6369900107383728, -0.22081999480724335, -0.055727001279592514, -0.04667799919843674, -0.021976999938488007, 0.2521800100803375, -0.3626199960708618, -0.44385001063346863, 0.23422999680042267, -0.2960599958896637, 0.27581000328063965, -0.4600600004196167, -0.2973000109195709, 0.2291100025177002, -0.26287999749183655, -0.17677000164985657, -0.20879000425338745, 0.04282199963927269, 0.06836599856615067, 0.0462069995701313, -0.29576000571250916, 0.16720999777317047, 0.09928199648857117, 0.1787099987268448, -0.01917400024831295, 0.22393999993801117, -0.15181000530719757, -0.00725860008969903, 0.32798001170158386, -0.1253100037574768, -0.3558900058269501, -0.259550005197525, 0.1915699988603592, 0.12301000207662582, 0.055059999227523804, 0.042086999863386154, -0.05336799845099449, -0.03662500157952309, -0.008381499908864498, 0.29385998845100403, 0.4620400071144104, -0.4527699947357178, -0.1402599960565567, -0.30518001317977905, -0.1588599979877472, 0.15480999648571014, -0.1827400028705597, -0.06091799959540367, -0.09814099967479706, 0.08395799994468689, -0.09937699884176254, 0.3749299943447113, 0.008804099634289742, -0.017026999965310097, -0.15807999670505524, -0.3319700062274933, -0.17244000732898712, 0.40182000398635864, 0.3268199861049652, -0.21874000132083893, 0.008180400356650352, 0.17903999984264374, -0.05737899988889694, -0.3682500123977661, 0.6172900199890137, -0.5119600296020508, 0.4818199872970581, -0.48688000440597534, 0.1863899976015091, -0.05540600046515465, 0.015189999714493752, 0.3781200051307678, -0.20677000284194946, -0.07175099849700928, -0.043258000165224075, 0.2520500123500824, -0.14336000382900238, 0.019354000687599182, 0.0018810000037774444, 0.23138999938964844, 0.011704999953508377, -0.05620700120925903, -0.1839900016784668, 0.02332399971783161, 0.430649995803833, -0.14225000143051147, -0.06363700330257416, -0.024734999984502792, 0.6469299793243408, 0.08704700320959091, 0.21649999916553497, -0.32453998923301697, 0.003119200002402067, -0.14620999991893768, -0.4253300130367279, 0.27312999963760376, -0.21748000383377075, -0.1295499950647354, 0.1472499966621399, -0.3520900011062622, -0.15934999287128448, -0.18084999918937683, -0.03856299817562103, -0.001919299946166575, 0.486380010843277, -0.39612001180648804, -0.14733999967575073, -0.08657100051641464, 0.24065999686717987, -0.18932999670505524, -0.05623000115156174, -0.39601999521255493, -0.02419400028884411, 0.2483000010251999, -0.21182000637054443, 0.24564999341964722, 0.13033999502658844, -0.6694899797439575, -0.09079399704933167, -0.3066999912261963, -0.213359996676445, -0.5126799941062927, -0.10078000277280807, 0.016259999945759773, -0.3590700030326843, -0.6724600195884705, -0.06851000338792801, 0.18032999336719513, -0.27046000957489014, 0.10553000122308731, -0.2527500092983246, -0.048888999968767166, -0.057969000190496445, 0.2001499980688095, 0.0929969996213913, -0.219650000333786, -0.11497999727725983, -0.2176000028848648, 0.42743000388145447, -0.2325800061225891, 0.02657799981534481, 0.1728699952363968, -0.3887700140476227, -0.5152599811553955, -0.07049799710512161, -0.07272899895906448, -0.24771000444889069, -0.3136399984359741, 0.39364001154899597, -0.3206300139427185, 0.4974600076675415, -0.08348900079727173, -0.18881000578403473, 0.01774900034070015, -0.3089900016784668, 0.19631999731063843, -0.09247399866580963, 0.035718001425266266, -0.2978900074958801, -0.07786300033330917, -0.09465400129556656, -0.11868999898433685, 0.32798001170158386, 0.004705400206148624, -0.02472900040447712, 0.44005998969078064, 0.2544800043106079, 0.15065999329090118, 0.12247999757528305, -0.37975001335144043, -0.21815000474452972, 0.24222999811172485, -0.04701400175690651, -0.22370000183582306, -0.07472100108861923, -0.14072999358177185, -0.010308999568223953, -0.24412000179290771, 0.04747899994254112, -0.05322200059890747, 0.8121899962425232, -0.029982000589370728, -0.032552000135183334, 0.06620900332927704, 0.1602099984884262, 0.3334699869155884, -2.000200033187866, 0.32082000374794006, 0.5582200288772583, 0.37900999188423157, -0.020015999674797058, -0.045198000967502594, 0.18565000593662262, -0.16179999709129333, -0.18916000425815582, -0.2361699938774109, 0.4108099937438965, 0.19767999649047852, -0.30305999517440796, 0.3927299976348877, 0.44898998737335205, 0.37929001450538635, -0.02737399935722351, -0.47363001108169556, 0.14371000230312347, -0.08166199922561646, 0.15150000154972076, -0.2247299998998642, 0.4113599956035614, -0.39149001240730286], [0.2352299988269806, -0.31360000371932983, -0.10181000083684921, -0.021012000739574432, 0.6062999963760376, 0.051934998482465744, -0.424809992313385, 0.20744000375270844, -0.06759300082921982, -2.726300001144409, 0.1545500010251999, 0.5796700119972229, -0.1114099994301796, -0.8546599745750427, -0.1604900062084198, -0.017729999497532845, 0.4175499975681305, -0.5090600252151489, 0.12021999806165695, 0.36127999424934387, 0.3128899931907654, 0.36230000853538513, 1.0669000148773193, 0.3608100116252899, -0.6714299917221069, 0.10367999970912933, -0.45699000358581543, 0.19925999641418457, -0.428739994764328, -0.4145599901676178, 0.344870001077652, -0.244609996676445, 0.11496999859809875, 0.24041999876499176, -0.7878199815750122, 0.37836000323295593, -0.0342090018093586, -0.0797320008277893, -0.14616000652313232, -0.34272000193595886, 0.4966300129890442, 0.22853000462055206, 0.26298999786376953, -0.2418300062417984, -0.7706900238990784, 0.04008600115776062, -0.7955999970436096, -0.33594998717308044, -0.9864000082015991, 0.3599900007247925, -0.2325199991464615, 0.007994299754500389, 0.19769999384880066, 0.07951299846172333, -0.1375100016593933, 0.07733800262212753, -0.042948998510837555, 0.17956000566482544, 0.11862000077962875, 0.09643799811601639, 0.43470001220703125, 0.0035248000640422106, 0.013466999866068363, 0.050916001200675964, -0.040254998952150345, -0.40803998708724976, 0.390720009803772, 0.02118000015616417, -0.37457001209259033, 0.10751000046730042, -0.2537499964237213, 0.06369899958372116, 0.025324000045657158, -0.07468099892139435, 0.45451998710632324, 0.3579699993133545, 0.35082998871803284, 0.03650199994444847, -0.2141599953174591, -0.29861000180244446, -0.05635799840092659, -0.05006200075149536, -0.13008999824523926, 0.6012499928474426, 0.603630006313324, -0.3434700071811676, -0.23711000382900238, -0.39368000626564026, -0.034915000200271606, -0.4456300139427185, 0.09670499712228775, -0.18313999474048615, -0.45041999220848083, 0.1156499981880188, 0.01271700020879507, -0.3779900074005127, 0.10047999769449234, 0.4107699990272522, -0.424699991941452, -0.39228999614715576, -0.22166000306606293, -0.08123300224542618, 0.0149959996342659, 0.1269800066947937, -0.7153000235557556, 0.23100000619888306, -0.40261000394821167, -0.026079000905156136, -0.1785999983549118, -0.10930000245571136, -0.049702998250722885, -0.6083400249481201, 0.029224000871181488, 0.2893800139427185, 0.053947001695632935, 0.07940500229597092, 0.04598800092935562, -0.09467600286006927, -0.29774999618530273, -0.03853999823331833, 0.16987000405788422, 0.17116999626159668, -0.14781999588012695, 0.09998100250959396, 0.03854599967598915, 0.009360999800264835, -0.14497999846935272, 0.0702970027923584, -0.013387000188231468, 0.08872800320386887, 0.17364999651908875, -0.06086299940943718, 0.018811000511050224, -0.3930499851703644, -0.024636000394821167, 0.6468200087547302, 0.1706800013780594, -0.11873000115156174, 0.023267000913619995, 0.2788600027561188, 0.34560999274253845, 0.26065999269485474, 0.051465000957250595, -0.33866000175476074, -0.47975000739097595, -0.007972599938511848, 0.008008000440895557, 0.04073299840092659, -0.035583000630140305, 0.0911559984087944, 0.4909999966621399, 0.11829999834299088, 0.5492600202560425, -0.15666000545024872, -0.6155300140380859, 0.048330001533031464, -0.3237000107765198, -0.18883000314235687, -0.37571999430656433, 0.003382300026714802, -0.10129000246524811, -0.004562799818813801, 0.06201300024986267, -0.07307399809360504, -0.10690999776124954, -0.27028000354766846, -0.008489600382745266, -0.0687130019068718, -0.15157000720500946, 0.15123000741004944, 0.5906800031661987, -0.042410001158714294, -0.6942300200462341, -0.4124000072479248, -0.15786999464035034, -0.3465699851512909, -0.048245999962091446, -0.2542400062084198, -0.22089000046253204, 0.3725599944591522, 0.1362999975681305, -0.49145999550819397, -0.008012300357222557, -0.06500499695539474, -0.15749000012874603, 0.1899999976158142, -0.272379994392395, -0.17962999641895294, -0.10909000039100647, -0.23949000239372253, -0.29811999201774597, 0.16468000411987305, 0.04174799844622612, -0.09615600109100342, -0.041127000004053116, 0.20758000016212463, 0.19773000478744507, 0.012296999804675579, 0.5277400016784668, 0.16433000564575195, 0.32374000549316406, 0.055470000952482224, 0.05247199907898903, 0.3340199887752533, 0.20928999781608582, 0.6636499762535095, -0.04136300086975098, -0.02718699909746647, 0.10796000063419342, 0.09161499887704849, 0.18062999844551086, -0.3755500018596649, 0.2334199994802475, 0.24563999474048615, -0.2899799942970276, -0.332179993391037, -0.2747800052165985, 0.16011999547481537, 0.14253999292850494, -0.352510005235672, -0.09959299862384796, 0.4396600127220154, 0.07932200282812119, 0.3585599958896637, 0.038860999047756195, 0.1838500052690506, 0.04969299957156181, 0.23820999264717102, 0.008838599547743797, -0.21261000633239746, 0.1146399974822998, 0.22134999930858612, 0.42969998717308044, 0.07029800117015839, -0.2670699954032898, -0.304720014333725, -0.07128900289535522, -0.006756999995559454, 0.058396998792886734, 0.2558799982070923, -0.1399800032377243, 0.4384399950504303, 0.9258800148963928, -0.20798000693321228, -0.7511299848556519, 0.6716499924659729, -0.0010554000036790967, -0.0022907000966370106, 0.5867300033569336, -0.19464999437332153, 0.24735000729560852, 0.13967999815940857, 0.30491000413894653, 0.31727999448776245, 0.12578000128269196, -0.1624699980020523, -0.14312000572681427, -0.11321999877691269, 0.02339800074696541, -0.08502600342035294, -0.5037599802017212, 0.17146000266075134, 0.09093499928712845, 0.3236300051212311, 0.04627300053834915, -0.3292999863624573, -0.25859999656677246, 0.3596700131893158, -0.5802099704742432, 0.19380000233650208, -0.24275000393390656, -0.048516999930143356, -0.21107999980449677, 0.1802700012922287, -0.26701998710632324, -0.3592100143432617, -1.7663999795913696, 0.8353099822998047, 1.5960999727249146, -0.5317100286483765, 0.281139999628067, -0.763979971408844, -0.23702000081539154, -0.19147999584674835, 0.6325100064277649, -0.3054499924182892, 0.03641999885439873, -0.07974900305271149, -0.10134000331163406, 0.005502600222826004, -0.27928000688552856, -0.20566000044345856, -0.11508999764919281, 0.8832600116729736, 0.20360000431537628, 0.8120599985122681, -0.05241600051522255, -0.13504000008106232, -0.46542999148368835, 0.8752899765968323], [-0.5491200089454651, -0.5636699795722961, -0.4663499891757965, 0.19032999873161316, 0.3493500053882599, 0.08389899879693985, 0.4026699960231781, -0.020697999745607376, 0.4752500057220459, -1.30649995803833, -0.5039100050926208, 0.2796500027179718, 0.24334000051021576, -0.31053000688552856, -0.9953799843788147, 0.8493800163269043, -0.059804998338222504, 0.06893999874591827, -0.27663999795913696, -0.12075000256299973, 0.7676699757575989, 0.8789200186729431, 0.2986699938774109, -0.45052000880241394, -0.6275100111961365, -0.029349999502301216, -0.2871600091457367, 0.22908000648021698, -0.1363299936056137, -0.07967399805784225, -0.23711000382900238, -0.013031000271439552, -0.32322001457214355, -0.16222000122070312, -0.4198800027370453, -0.4459100067615509, -0.4267599880695343, -0.12551000714302063, 0.261709988117218, -0.6059600114822388, 0.42239999771118164, 0.0764399990439415, 0.7556999921798706, 0.22450999915599823, -0.5750799775123596, 0.39528998732566833, -0.13741999864578247, -0.1772499978542328, 0.008317000232636929, -0.09492100030183792, -0.12376999855041504, -0.10264000296592712, 0.47220999002456665, -0.08524899929761887, 0.49722999334335327, -0.3495599925518036, -0.048923999071121216, -0.41460999846458435, -0.2683500051498413, 0.3065600097179413, -0.03248700127005577, -0.14326000213623047, -0.33035001158714294, 0.3792699873447418, -0.4794999957084656, -0.38552001118659973, 0.2118699997663498, 0.11417999863624573, 0.5230799913406372, -0.42638999223709106, -0.6691100001335144, -0.09122899919748306, -0.1733500063419342, 0.18299999833106995, 0.021330000832676888, 0.829230010509491, 0.04454199969768524, -0.08146800100803375, -0.3677099943161011, -0.2662599980831146, -0.49511000514030457, 0.19232000410556793, -0.20848000049591064, 0.004019699990749359, 0.4605399966239929, 0.1512099951505661, 0.05114699900150299, 0.05825100094079971, -0.037438999861478806, -0.4656299948692322, -0.78711998462677, -0.18348999321460724, -0.1569499969482422, 0.8616399765014648, -0.21028999984264374, 0.2497899979352951, -0.3381099998950958, 0.32161998748779297, -0.32016998529434204, -0.4316200017929077, -0.0006170899723656476, -0.7074300050735474, 0.05882300063967705, -0.7436500191688538, 0.12594999372959137, 0.08059100061655045, 0.22979000210762024, 0.11146000027656555, 0.09661000221967697, -0.10419999808073044, 0.08528999984264374, 0.09032200276851654, -0.3882800042629242, -0.11097999662160873, 0.14248999953269958, 0.3379800021648407, 0.9399600028991699, 0.2623699903488159, -0.6031399965286255, -0.4186899960041046, 0.19665999710559845, 0.4260199964046478, 0.3615100085735321, 0.18616999685764313, 0.11858999729156494, -0.7384600043296814, -0.47341999411582947, -0.21152999997138977, 0.0491270013153553, 0.2028599977493286, 0.25558000802993774, 0.14334000647068024, -0.011064999736845493, -0.18028999865055084, 0.5152300000190735, -0.20236000418663025, 0.22937999665737152, -0.6898099780082703, -0.0005999099812470376, -0.15036000311374664, 0.36164000630378723, 0.33039000630378723, 0.7932100296020508, 0.038651999086141586, -0.3498699963092804, -0.5920400023460388, -0.20201000571250916, -0.3673900067806244, -0.2669599950313568, 0.4736599922180176, -0.008309399709105492, -0.546280026435852, 0.4666599929332733, 0.04217499867081642, -0.6294699907302856, -0.23594999313354492, -0.4498099982738495, 0.14499999582767487, -0.4763599932193756, -0.4419800043106079, 0.022936999797821045, -0.010583000257611275, -0.041464999318122864, -0.19728000462055206, 0.5634999871253967, -0.026263000443577766, 0.10752999782562256, 0.20720000565052032, -0.1045600026845932, 0.8481900095939636, -0.3731600046157837, -0.08367200195789337, -0.3591099977493286, 0.2067199945449829, -0.20469999313354492, -0.7595400214195251, 0.5943899750709534, 0.34365999698638916, 0.18714000284671783, -0.20798000693321228, 0.2066899985074997, -0.7496700286865234, -0.12639999389648438, -0.32003000378608704, -0.9569900035858154, -0.257750004529953, 0.09578599780797958, -0.39548999071121216, 0.40898001194000244, 0.6011300086975098, 0.36048001050949097, -1.0205999612808228, -0.328029990196228, -0.11524000018835068, -0.3043400049209595, 0.14002999663352966, 0.004296000115573406, 0.12833000719547272, -0.4315299987792969, -0.43963000178337097, -0.1555500030517578, 0.04438500106334686, 0.0013182000257074833, -0.10786999762058258, 0.4457699954509735, -0.12859000265598297, 0.14805999398231506, -0.08379600197076797, -0.1326099932193756, 0.2472199946641922, 0.4472300112247467, 0.3717600107192993, 0.47341999411582947, 0.3670800030231476, -0.2048799991607666, 0.03981100022792816, -0.3621000051498413, 0.23496000468730927, 0.07286199927330017, 0.21115000545978546, -0.6984800100326538, 0.18964999914169312, 0.5867300033569336, 0.07872100174427032, 0.09227500110864639, 0.22200000286102295, -0.42590001225471497, -0.05478699877858162, 0.11223000288009644, -0.03417399898171425, -0.6443600058555603, 0.1710599958896637, 0.18725000321865082, 0.03268299996852875, -0.3362799882888794, -0.7760300040245056, -0.1603499948978424, 0.4927099943161011, -0.45159000158309937, -0.2751699984073639, -0.28946998715400696, 0.500980019569397, 1.2315000295639038, 0.2218099981546402, -0.5742499828338623, 0.4343999922275543, -0.6336600184440613, -0.668969988822937, 0.4468100070953369, 0.027080999687314034, -0.0012719000224024057, 0.16981999576091766, 0.03847600147128105, -0.10546000301837921, -0.1001800000667572, 0.25707998871803284, 0.4468199908733368, -0.41846001148223877, 0.5002700090408325, 0.03282000124454498, 0.24698999524116516, -0.8695700168609619, 0.11643999814987183, -0.07035700231790543, -0.3458099961280823, 0.6339700222015381, -0.45530998706817627, -0.2880699932575226, 0.19666999578475952, -0.1329600065946579, 0.5340700149536133, -0.4878700077533722, 0.03961699828505516, -0.6909599900245667, -0.5341799855232239, 0.27344998717308044, -1.7402000427246094, 0.4976100027561188, 0.6842700242996216, -0.18633000552654266, 0.13902999460697174, -0.18240000307559967, -0.19243000447750092, -0.1959100067615509, -0.01642400026321411, -0.45662999153137207, 0.6832799911499023, -0.2678700089454651, 0.23339000344276428, -0.14670999348163605, 0.15456999838352203, 0.008100599981844425, -0.5299500226974487, -0.493149995803833, -0.3064500093460083, -0.29688000679016113, -0.27281999588012695, 0.5170599818229675, 0.12065999954938889, 0.12680000066757202], [-0.1051499992609024, 0.1340699940919876, 0.13839000463485718, -0.6470000147819519, 0.12430000305175781, 0.027521999552845955, -0.2065100073814392, 0.09720800071954727, -0.006438999902456999, -2.3401999473571777, 0.16649000346660614, 0.05077200010418892, -0.0797870010137558, -0.013648999854922295, 0.3507300019264221, 0.1936500072479248, -0.14839999377727509, 0.34228000044822693, -0.0521170012652874, -0.5550100207328796, 0.09510400146245956, -0.37703999876976013, -0.0898900032043457, 0.26954999566078186, 0.14508000016212463, -0.30215001106262207, 0.038795001804828644, 0.23402999341487885, -0.2573400139808655, 0.23677000403404236, 0.20965999364852905, 0.43841999769210815, 0.150409996509552, 0.1954600065946579, -0.3788500130176544, -0.056487999856472015, -0.08755200356245041, -0.443340003490448, -0.04109499976038933, -0.16294999420642853, -0.3070000112056732, 0.6467000246047974, -0.4063299894332886, -0.030734999105334282, 0.1404300034046173, -0.02550699934363365, 0.09655000269412994, 0.28299999237060547, 0.03594699874520302, 0.17728999257087708, 0.15839999914169312, -0.06455499678850174, 0.15242999792099, -0.039455000311136246, -0.1599999964237213, -0.09272199869155884, -0.2502799928188324, 0.11751999706029892, -0.09954400360584259, 0.213359996676445, 0.08443299680948257, 0.1962900012731552, 0.3768100142478943, 0.3459399938583374, 0.13465000689029694, -0.19520999491214752, -0.26403000950813293, 0.22561000287532806, 0.5093500018119812, 0.29638999700546265, 0.1919099986553192, 0.2580200135707855, 0.07542599737644196, 0.39614999294281006, -0.04692799970507622, 0.23357999324798584, 0.4288400113582611, 0.5227199792861938, -0.07342500239610672, -0.3963100016117096, 0.13368000090122223, -0.21313999593257904, -0.007353200111538172, -0.16232000291347504, 0.25804001092910767, -0.16354000568389893, -0.3481599986553192, 0.4076099991798401, -0.053693998605012894, 0.08468399941921234, -0.538919985294342, 0.2135699987411499, 0.3651700019836426, -0.1253100037574768, 0.12939000129699707, -0.021019000560045242, -0.39315998554229736, -0.13930000364780426, 0.45802998542785645, -0.3296099901199341, -0.3010700047016144, 0.1995300054550171, -0.43577998876571655, 0.1732800006866455, -0.2937299907207489, 0.07930000126361847, -0.34007999300956726, 0.20833000540733337, -0.32186999917030334, 0.17858999967575073, 0.14228999614715576, 0.06844700127840042, -0.26732000708580017, 0.09223099797964096, 0.04750100150704384, 0.396479994058609, 0.005472999997437, 0.7049700021743774, -0.07822299748659134, -0.23499999940395355, -0.26563000679016113, 0.2913700044155121, 0.36974000930786133, -0.5103600025177002, -0.2946699857711792, 0.2348099946975708, 0.08141200244426727, 0.49222999811172485, 0.19915999472141266, 0.19651000201702118, 0.24101999402046204, 0.3323799967765808, 0.5226399898529053, 0.23938000202178955, 0.0880889967083931, 0.24845999479293823, -0.15556000173091888, -0.1529500037431717, 0.006044100038707256, 0.05777199938893318, 0.00023751999833621085, -0.12675000727176666, 0.13123999536037445, -0.3559400141239166, -0.10673999786376953, -0.02806999906897545, 0.0013218000531196594, -0.10078000277280807, 0.0526139996945858, 0.11124999821186066, -0.24151000380516052, -0.22972999513149261, 